index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-02-21 Tue 19:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title></title>
<meta name="generator" content="Org mode">
<meta name="author" content="Erik Sjöstrand">
<link rel='stylesheet' type='text/css' href='css/style.css'>
</head>
<body>
<div id="preamble" class="status">
<div id="head">
    <h1>Kungsgeten &mdash; </h1>
    <ul>
        <li><a href="index.html">Home</a></li>
        <li><a href="archive.html">Archive</a></li>
        <li><a href="static_about.html">About</a></li>
    </ul>
</div>
</div>
<div id="content">

<div id="outline-container-org4d8dda8" class="outline-2 blogcategory">
<h2 id="org4d8dda8">Emacs</h2>
<div class="outline-text-2" id="text-org4d8dda8">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-10-07 Fri] </span></span> <a href="ryo-modal.html"><span class="underline">RYO</span></a> &#x2013; <i>Roll your own modal mode!</i></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-08-15 Mon] </span></span> <a href="yankpad13.html">Yankpad 1.3</a> &#x2013; <i>Keywords and function calls</i></li>
<li><span class="timestamp-wrapper"><span class="timestamp">[2016-07-03 Sun] </span></span> <a href="yankpad.html">Yankpad</a> &#x2013; <i>Text snippets using org-mode</i></li>
</ul>
</div>
</div>

<div id="outline-container-org8df81d5" class="outline-2 blogcategory">
<h2 id="org8df81d5">The Steaming Pile</h2>
<div class="outline-text-2" id="text-org8df81d5">
<p>
As of 2017-02-16 I have 409 games in <a href="http://steamcommunity.com/id/clerik/">my Steam account</a>, I haven&rsquo;t even started the majority of them. Using <a href="https://github.com/kungsgeten/steam.el">an organizational tool</a> I&rsquo;ve divided these games into several categories, one of them being <i>games to try</i> containing 95 games alone. So <i>The Steaming Pile</i> is my attempt to <i>play more, buy less</i> and go through my backlog, providing my thoughts along the way.
</p>
</div>

<div id="outline-container-org6a539a9" class="outline-3">
<h3 id="org6a539a9"><span class="done DONE">DONE</span> <a href="dungetris.html">Dungetris</a> <span class="timestamp-wrapper"><span class="timestamp">[2017-02-21 Tue]</span></span></h3>
</div>
<div id="outline-container-orgd800512" class="outline-3">
<h3 id="orgd800512"><span class="todo TODO">TODO</span> A Bird Story</h3>
</div>
<div id="outline-container-org262940f" class="outline-3">
<h3 id="org262940f"><span class="todo TODO">TODO</span> A Boy and His Blob</h3>
</div>
<div id="outline-container-orgffbdb01" class="outline-3">
<h3 id="orgffbdb01"><span class="todo TODO">TODO</span> A Wizard&rsquo;s Lizard</h3>
</div>
<div id="outline-container-org661e34a" class="outline-3">
<h3 id="org661e34a"><a id="ID-d7719589-66d3-43bc-80b6-239629c58e17"></a><span class="todo TODO">TODO</span> AI War: Fleet Command</h3>
<div class="outline-text-3" id="text-org661e34a">
</div>
</div>
<div id="outline-container-org756724d" class="outline-3">
<h3 id="org756724d"><span class="todo TODO">TODO</span> Anno 2070</h3>
</div>
<div id="outline-container-org895ae47" class="outline-3">
<h3 id="org895ae47"><a id="ID-540d1e36-6ad8-4b3b-b281-539363ece12a"></a><span class="todo TODO">TODO</span> Assault Android Cactus</h3>
<div class="outline-text-3" id="text-org895ae47">
</div>
</div>
<div id="outline-container-org9de86e4" class="outline-3">
<h3 id="org9de86e4"><span class="todo TODO">TODO</span> Bionic Dues</h3>
</div>
<div id="outline-container-org6e8b4f3" class="outline-3">
<h3 id="org6e8b4f3"><span class="todo TODO">TODO</span> Broken Age</h3>
</div>
<div id="outline-container-org0c5aa12" class="outline-3">
<h3 id="org0c5aa12"><span class="todo TODO">TODO</span> Brothers - A Tale of Two Sons</h3>
</div>
<div id="outline-container-orge8ef6b1" class="outline-3">
<h3 id="orge8ef6b1"><span class="todo TODO">TODO</span> Brütal Legend</h3>
</div>
<div id="outline-container-orge36c5aa" class="outline-3">
<h3 id="orge36c5aa"><span class="todo TODO">TODO</span> Child of Light</h3>
</div>
<div id="outline-container-org3e97ef5" class="outline-3">
<h3 id="org3e97ef5"><a id="ID-6007859b-6fa3-4f7d-aba7-3b2d016e601b"></a><span class="todo TODO">TODO</span> Chroma Squad</h3>
<div class="outline-text-3" id="text-org3e97ef5">
</div>
</div>
<div id="outline-container-org11daa56" class="outline-3">
<h3 id="org11daa56"><span class="todo TODO">TODO</span> Cibele</h3>
</div>
<div id="outline-container-org32261c5" class="outline-3">
<h3 id="org32261c5"><span class="todo TODO">TODO</span> Convoy</h3>
</div>
<div id="outline-container-orgb22e78b" class="outline-3">
<h3 id="orgb22e78b"><span class="todo TODO">TODO</span> Costume Quest</h3>
</div>
<div id="outline-container-org2f0a00e" class="outline-3">
<h3 id="org2f0a00e"><span class="todo TODO">TODO</span> Crimzon Clover  WORLD IGNITION</h3>
</div>
<div id="outline-container-org037ccc9" class="outline-3">
<h3 id="org037ccc9"><a id="ID-9e90684b-1a31-4adc-b10a-1405c2220513"></a><span class="todo TODO">TODO</span> CRYPTARK</h3>
<div class="outline-text-3" id="text-org037ccc9">
</div>
</div>
<div id="outline-container-orgd2710b3" class="outline-3">
<h3 id="orgd2710b3"><span class="todo TODO">TODO</span> Dark Souls: Prepare to Die Edition</h3>
</div>
<div id="outline-container-org6e1568c" class="outline-3">
<h3 id="org6e1568c"><span class="todo TODO">TODO</span> Delver</h3>
</div>
<div id="outline-container-org907ad30" class="outline-3">
<h3 id="org907ad30"><span class="todo TODO">TODO</span> Deponia: The Complete Journey</h3>
</div>
<div id="outline-container-org02e3cb1" class="outline-3">
<h3 id="org02e3cb1"><a id="ID-edae0237-ff82-4361-8c68-15532452728d"></a><span class="todo TODO">TODO</span> Devil Daggers</h3>
<div class="outline-text-3" id="text-org02e3cb1">
</div>
</div>
<div id="outline-container-orgbd065c1" class="outline-3">
<h3 id="orgbd065c1"><a id="ID-6baa8e3f-5e95-4066-8acd-9794477d36ce"></a><span class="todo TODO">TODO</span> Disgaea PC</h3>
<div class="outline-text-3" id="text-orgbd065c1">
</div>
</div>
<div id="outline-container-org2c229f4" class="outline-3">
<h3 id="org2c229f4"><span class="todo TODO">TODO</span> Dominions 4</h3>
</div>
<div id="outline-container-org568d6da" class="outline-3">
<h3 id="org568d6da"><span class="todo TODO">TODO</span> Dropsy</h3>
</div>
<div id="outline-container-org56023be" class="outline-3">
<h3 id="org56023be"><span class="todo TODO">TODO</span> Dust: An Elysian Tail</h3>
</div>
<div id="outline-container-org74570da" class="outline-3">
<h3 id="org74570da"><span class="todo TODO">TODO</span> Dustforce</h3>
</div>
<div id="outline-container-org69d6815" class="outline-3">
<h3 id="org69d6815"><span class="todo TODO">TODO</span> Dynamite Jack</h3>
</div>
<div id="outline-container-orgfd7fe22" class="outline-3">
<h3 id="orgfd7fe22"><span class="todo TODO">TODO</span> Eets Munchies</h3>
</div>
<div id="outline-container-org45b007c" class="outline-3">
<h3 id="org45b007c"><a id="ID-c4eb9271-7c7a-4fe2-8ec3-e7aa96e05f60"></a><span class="todo TODO">TODO</span> Elegy For A Dead World</h3>
<div class="outline-text-3" id="text-org45b007c">
</div>
</div>
<div id="outline-container-org8783a44" class="outline-3">
<h3 id="org8783a44"><a id="ID-d008dfc3-8da6-4a08-9d8a-7cbd038c7475"></a><span class="todo TODO">TODO</span> Ellipsis</h3>
<div class="outline-text-3" id="text-org8783a44">
</div>
</div>
<div id="outline-container-org2b18106" class="outline-3">
<h3 id="org2b18106"><span class="todo TODO">TODO</span> Endless Legend</h3>
</div>
<div id="outline-container-orge8b7cc8" class="outline-3">
<h3 id="orge8b7cc8"><a id="ID-1e0fd321-a6a6-4f9c-a4d9-dba55690585f"></a><span class="todo TODO">TODO</span> Endless Sky</h3>
<div class="outline-text-3" id="text-orge8b7cc8">
</div>
</div>
<div id="outline-container-org4f947ca" class="outline-3">
<h3 id="org4f947ca"><span class="todo TODO">TODO</span> Environmental Station Alpha</h3>
</div>
<div id="outline-container-org85da7ac" class="outline-3">
<h3 id="org85da7ac"><span class="todo TODO">TODO</span> Euro Truck Simulator 2</h3>
</div>
<div id="outline-container-org23fcee4" class="outline-3">
<h3 id="org23fcee4"><span class="todo TODO">TODO</span> Europa Universalis IV</h3>
</div>
<div id="outline-container-org9b0189f" class="outline-3">
<h3 id="org9b0189f"><a id="ID-ed192bf7-1a45-49e5-8662-4ceb78333db8"></a><span class="todo TODO">TODO</span> Firewatch</h3>
<div class="outline-text-3" id="text-org9b0189f">
</div>
</div>
<div id="outline-container-org3d12370" class="outline-3">
<h3 id="org3d12370"><span class="todo TODO">TODO</span> Frozen Cortex</h3>
</div>
<div id="outline-container-org9401836" class="outline-3">
<h3 id="org9401836"><a id="ID-a84f7672-cd19-4367-98ce-8f3d8df5140d"></a><span class="todo TODO">TODO</span> Girls Like Robots</h3>
<div class="outline-text-3" id="text-org9401836">
</div>
</div>
<div id="outline-container-org0cf3386" class="outline-3">
<h3 id="org0cf3386"><span class="todo TODO">TODO</span> Gods Will Be Watching</h3>
</div>
<div id="outline-container-org1177c5a" class="outline-3">
<h3 id="org1177c5a"><span class="todo TODO">TODO</span> Gone Home</h3>
</div>
<div id="outline-container-org2bc23d6" class="outline-3">
<h3 id="org2bc23d6"><a id="ID-421e2b61-bf2b-40b1-8b56-61d2421a9ea2"></a><span class="todo TODO">TODO</span> Guacamelee! Super Turbo Championship Edition</h3>
<div class="outline-text-3" id="text-org2bc23d6">
</div>
</div>
<div id="outline-container-orgc9be653" class="outline-3">
<h3 id="orgc9be653"><span class="todo TODO">TODO</span> Hack &rsquo;n&rsquo; Slash</h3>
</div>
<div id="outline-container-org59ce31b" class="outline-3">
<h3 id="org59ce31b"><span class="todo TODO">TODO</span> Hatoful Boyfriend: Holiday Star</h3>
</div>
<div id="outline-container-org69ba8e5" class="outline-3">
<h3 id="org69ba8e5"><a id="ID-b7d5aa01-e098-4e0f-be56-f89a475fa0f4"></a><span class="todo TODO">TODO</span> Hot Tin Roof: The Cat That Wore A Fedora</h3>
<div class="outline-text-3" id="text-org69ba8e5">
</div>
</div>
<div id="outline-container-orgc194948" class="outline-3">
<h3 id="orgc194948"><a id="ID-75903aa9-767d-4ab7-a179-8d13e7d6383d"></a><span class="todo TODO">TODO</span> INSIDE</h3>
<div class="outline-text-3" id="text-orgc194948">
</div>
</div>
<div id="outline-container-org464486e" class="outline-3">
<h3 id="org464486e"><span class="todo TODO">TODO</span> La-Mulana</h3>
</div>
<div id="outline-container-orgce86c7c" class="outline-3">
<h3 id="orgce86c7c"><a id="ID-9f91f33f-12b5-4caa-b67b-04b7ab77f237"></a><span class="todo TODO">TODO</span> Little King&rsquo;s Story</h3>
<div class="outline-text-3" id="text-orgce86c7c">
</div>
</div>
<div id="outline-container-org9ba062d" class="outline-3">
<h3 id="org9ba062d"><span class="todo TODO">TODO</span> Lumino City</h3>
</div>
<div id="outline-container-org6d810b6" class="outline-3">
<h3 id="org6d810b6"><span class="todo TODO">TODO</span> MASSIVE CHALICE</h3>
</div>
<div id="outline-container-orgdde963d" class="outline-3">
<h3 id="orgdde963d"><span class="todo TODO">TODO</span> Mercenary Kings</h3>
</div>
<div id="outline-container-org71fb4d2" class="outline-3">
<h3 id="org71fb4d2"><a id="ID-c729d0d7-e687-4810-bbe3-49d178e5f11f"></a><span class="todo TODO">TODO</span> Mushroom 11</h3>
<div class="outline-text-3" id="text-org71fb4d2">
</div>
</div>
<div id="outline-container-org282f138" class="outline-3">
<h3 id="org282f138"><span class="todo TODO">TODO</span> No Time to Explain</h3>
</div>
<div id="outline-container-orgdbb213f" class="outline-3">
<h3 id="orgdbb213f"><span class="todo TODO">TODO</span> NOT A HERO</h3>
</div>
<div id="outline-container-orgdf06e42" class="outline-3">
<h3 id="orgdf06e42"><span class="todo TODO">TODO</span> Not The Robots</h3>
</div>
<div id="outline-container-orga3b346a" class="outline-3">
<h3 id="orga3b346a"><span class="todo TODO">TODO</span> Offworld Trading Company</h3>
</div>
<div id="outline-container-orga45b8ae" class="outline-3">
<h3 id="orga45b8ae"><span class="todo TODO">TODO</span> Oil Rush</h3>
</div>
<div id="outline-container-org2d0e340" class="outline-3">
<h3 id="org2d0e340"><span class="todo TODO">TODO</span> Ori and the Blind Forest</h3>
</div>
<div id="outline-container-orgddc8070" class="outline-3">
<h3 id="orgddc8070"><span class="todo TODO">TODO</span> Phantom Breaker: Battle Grounds</h3>
</div>
<div id="outline-container-orgf25ced9" class="outline-3">
<h3 id="orgf25ced9"><a id="ID-97a55fac-aa2f-462d-a056-53be6a3c2459"></a><span class="todo TODO">TODO</span> Prison Architect</h3>
<div class="outline-text-3" id="text-orgf25ced9">
</div>
</div>
<div id="outline-container-org032fbd2" class="outline-3">
<h3 id="org032fbd2"><span class="todo TODO">TODO</span> Raiden IV: OverKill</h3>
</div>
<div id="outline-container-org284e8d7" class="outline-3">
<h3 id="org284e8d7"><span class="todo TODO">TODO</span> Read Only Memories</h3>
</div>
<div id="outline-container-org3205e18" class="outline-3">
<h3 id="org3205e18"><span class="todo TODO">TODO</span> Recettear: An Item Shop&rsquo;s Tale</h3>
</div>
<div id="outline-container-org6714c41" class="outline-3">
<h3 id="org6714c41"><a id="ID-f9b1213a-3e63-40c8-b732-f3d40bafe330"></a><span class="todo TODO">TODO</span> Retro Game Crunch</h3>
<div class="outline-text-3" id="text-org6714c41">
</div>
</div>
<div id="outline-container-orgffed1c0" class="outline-3">
<h3 id="orgffed1c0"><a id="ID-4de46677-f26d-4350-aab7-e972cbfef7ca"></a><span class="todo TODO">TODO</span> Road to Ballhalla</h3>
<div class="outline-text-3" id="text-orgffed1c0">
</div>
</div>
<div id="outline-container-orge0a93b9" class="outline-3">
<h3 id="orge0a93b9"><a id="ID-d10f501c-bcd2-4ce6-9249-1c4f4c5513de"></a><span class="todo TODO">TODO</span> ROCKETSROCKETSROCKETS</h3>
<div class="outline-text-3" id="text-orge0a93b9">
</div>
</div>
<div id="outline-container-org9fd93c0" class="outline-3">
<h3 id="org9fd93c0"><span class="todo TODO">TODO</span> ROD: Revolt Of Defense</h3>
</div>
<div id="outline-container-orgdf6e6cc" class="outline-3">
<h3 id="orgdf6e6cc"><span class="todo TODO">TODO</span> RONIN</h3>
</div>
<div id="outline-container-orge93b84c" class="outline-3">
<h3 id="orge93b84c"><span class="todo TODO">TODO</span> Shantae: Risky&rsquo;s Revenge - Director&rsquo;s Cut</h3>
</div>
<div id="outline-container-org5639f8b" class="outline-3">
<h3 id="org5639f8b"><a id="ID-49974eda-7219-4b9e-ac87-929cb67fe2ea"></a><span class="todo TODO">TODO</span> Song of the Deep</h3>
<div class="outline-text-3" id="text-org5639f8b">
</div>
</div>
<div id="outline-container-org54f9aac" class="outline-3">
<h3 id="org54f9aac"><span class="todo TODO">TODO</span> SpaceChem</h3>
</div>
<div id="outline-container-orge636022" class="outline-3">
<h3 id="orge636022"><a id="ID-ad33e79f-fd65-4db6-a0e5-2225bb2a0fa8"></a><span class="todo TODO">TODO</span> Sproggiwood</h3>
<div class="outline-text-3" id="text-orge636022">
</div>
</div>
<div id="outline-container-org75c857a" class="outline-3">
<h3 id="org75c857a"><span class="todo TODO">TODO</span> Super Splatters</h3>
</div>
<div id="outline-container-orgcc7a7a5" class="outline-3">
<h3 id="orgcc7a7a5"><span class="todo TODO">TODO</span> Superbrothers: Sword &amp; Sworcery EP</h3>
</div>
<div id="outline-container-orgeae49d4" class="outline-3">
<h3 id="orgeae49d4"><a id="ID-7f1ad6ac-7e25-43a9-a0d5-4de283f2157a"></a><span class="todo TODO">TODO</span> Tadpole Treble</h3>
<div class="outline-text-3" id="text-orgeae49d4">
</div>
</div>
<div id="outline-container-org23c6474" class="outline-3">
<h3 id="org23c6474"><span class="todo TODO">TODO</span> The Aquatic Adventure of the Last Human</h3>
</div>
<div id="outline-container-org292f273" class="outline-3">
<h3 id="org292f273"><a id="ID-fe6b35da-1563-4095-a653-9b55897a71cd"></a><span class="todo TODO">TODO</span> The Escapists</h3>
<div class="outline-text-3" id="text-org292f273">
</div>
</div>
<div id="outline-container-org2a922eb" class="outline-3">
<h3 id="org2a922eb"><a id="ID-ae94f5de-c1c7-4ad8-aa27-7f3fc181bb76"></a><span class="todo TODO">TODO</span> The Flame in the Flood</h3>
<div class="outline-text-3" id="text-org2a922eb">
</div>
</div>
<div id="outline-container-org376b33f" class="outline-3">
<h3 id="org376b33f"><span class="todo TODO">TODO</span> The Nightmare Cooperative</h3>
</div>
<div id="outline-container-org1c9700b" class="outline-3">
<h3 id="org1c9700b"><a id="ID-58a20a6c-b53b-4607-b2de-ea8ee1c18070"></a><span class="todo TODO">TODO</span> The Silent Age</h3>
<div class="outline-text-3" id="text-org1c9700b">
</div>
</div>
<div id="outline-container-orgc33bedf" class="outline-3">
<h3 id="orgc33bedf"><span class="todo TODO">TODO</span> The Talos Principle</h3>
</div>
<div id="outline-container-org9a7aca8" class="outline-3">
<h3 id="org9a7aca8"><span class="todo TODO">TODO</span> The Vanishing of Ethan Carter - Redux</h3>
</div>
<div id="outline-container-org640fe99" class="outline-3">
<h3 id="org640fe99"><a id="ID-0ec8953c-2e16-4535-8ab2-6c69bf1c1be9"></a><span class="todo TODO">TODO</span> The Witness</h3>
<div class="outline-text-3" id="text-org640fe99">
</div>
</div>
<div id="outline-container-orgd6bfaf2" class="outline-3">
<h3 id="orgd6bfaf2"><span class="todo TODO">TODO</span> The Wolf Among Us</h3>
</div>
<div id="outline-container-orga1c87c8" class="outline-3">
<h3 id="orga1c87c8"><span class="todo TODO">TODO</span> This War of Mine</h3>
</div>
<div id="outline-container-org896c042" class="outline-3">
<h3 id="org896c042"><span class="todo TODO">TODO</span> Titan Souls</h3>
</div>
<div id="outline-container-org797f1f7" class="outline-3">
<h3 id="org797f1f7"><a id="ID-7e95ce18-8bf2-43ed-a329-cbb3dc00a354"></a><span class="todo TODO">TODO</span> Tower of Guns</h3>
<div class="outline-text-3" id="text-org797f1f7">
</div>
</div>
<div id="outline-container-org6542f17" class="outline-3">
<h3 id="org6542f17"><span class="todo TODO">TODO</span> Transistor</h3>
</div>
<div id="outline-container-org6a8ee4b" class="outline-3">
<h3 id="org6a8ee4b"><span class="todo TODO">TODO</span> Tropico 4</h3>
</div>
<div id="outline-container-org0b1bb7b" class="outline-3">
<h3 id="org0b1bb7b"><a id="ID-da801629-78fc-467e-828b-3ad6454e14e9"></a><span class="todo TODO">TODO</span> Twilight Struggle</h3>
<div class="outline-text-3" id="text-org0b1bb7b">
</div>
</div>
<div id="outline-container-orga202ca3" class="outline-3">
<h3 id="orga202ca3"><a id="ID-f787d87d-ba40-49af-99df-f7b5e21c646c"></a><span class="todo TODO">TODO</span> Undertale</h3>
<div class="outline-text-3" id="text-orga202ca3">
</div>
</div>
<div id="outline-container-org6a6adf1" class="outline-3">
<h3 id="org6a6adf1"><a id="ID-f989d39f-a51e-416e-8edd-5f506f28f2fc"></a><span class="todo TODO">TODO</span> Valiant Hearts: The Great War</h3>
<div class="outline-text-3" id="text-org6a6adf1">
</div>
</div>
<div id="outline-container-orgeda5b62" class="outline-3">
<h3 id="orgeda5b62"><a id="ID-9e30d23c-45b3-490e-b465-aa8b93850920"></a><span class="todo TODO">TODO</span> Waking Mars</h3>
<div class="outline-text-3" id="text-orgeda5b62">
</div>
</div>
<div id="outline-container-org0235675" class="outline-3">
<h3 id="org0235675"><a id="ID-06bf7a2f-3d70-4553-8544-19b4a75549c6"></a><span class="todo TODO">TODO</span> Westerado: Double Barreled</h3>
<div class="outline-text-3" id="text-org0235675">
</div>
</div>
<div id="outline-container-org7e1a587" class="outline-3">
<h3 id="org7e1a587"><span class="todo TODO">TODO</span> XCOM: Enemy Unknown</h3>
</div>
</div>
</div>
</body>
</html>
